DebutantFR/app/controllers/posts_controller.rb

  def create
    @post = Post.new(content: params[:content])
    if @post.save
---
INSERT INTO "posts" ("content", "created_at", "updated_at") VALUES (?, ?, ?)  [["content", "Bonjour a tous!"], ["created_at", "2022-08-17 20:00:35.017765"], ["updated_at", "2022-08-17 20:00:35.017765"]]