kebumen_investasi/app/controllers/users_controller.rb

  def create
    @user = User.new(
      name: params[:name],
      email: params[:email],
      image_name: "default_user.jpg",
      password: params[:password]
    )
    if @user.save
---
INSERT INTO "users" ("name", "password_digest", "image_name", "created_at", "updated_at", "email", "password") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    @user = User.find_by(id: params[:id])
    @user.name = params[:name]
    @user.email = params[:email]

    if params[:image]
      @user.image_name = "#{@user.id}.jpg"
      image = params[:image]
      File.binwrite("public/user_images/#{@user.image_name}", image.read)
    end

    if @user.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "updated_at" = ?, "email" = ? WHERE "users"."id" = ?  [["name", "admin"], ["updated_at", "2022-08-15 15:36:12.523167"], ["email", "admin@kebumeninvestasi.com"], ["id", 3]]

  def login
    # Rewrite the following line to only use the email to find the user
    @user = User.find_by(email: params[:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "hanif@gmail.com"], ["LIMIT", 1]]