kebumen_aspirasi_v1/app/controllers/posts_controller.rb

INSERT INTO "posts" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "post"], ["user_id", 1], ["created_at", "2022-08-12 14:23:07.315200"], ["updated_at", "2022-08-12 14:23:07.315200"]]
---
  def create
    @post = Post.new(
      content: params[:content],
      user_id: @current_user.id
    )
    if @post.save